Tekla.Structures.Drawing.View.LabelLineLengthType
The label line length types.

Tekla.Structures.Drawing.View.LabelLineLengthType.Minimal
The label is of minimal possible length according to the label text.

Tekla.Structures.Drawing.View.LabelLineLengthType.Custom
The label is of custom length.